using System;
using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace OutpatientClinicsComplex.Migrations
{
    /// <inheritdoc />
    public partial class datasetprescription : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Prescription",
                columns: new[] { "Id", "NationalId", "DoctorCode", "Medicines", "PharmacistCode", "PrescriptionDate", "Status" },
                values: new object[,]
                {
                    { 1, 29107080694344L, 4, "أوميبرازول 20mg - مرة يومياً قبل الأكل", 4, new DateOnly(2025, 6, 7), "Dispensed" },
                    { 2, 28907181573718L, 1, "أتورفاستاتين 20mg - مرة يومياً", 1, new DateOnly(2025, 7, 16), "Dispensed" },
                    { 3, 27211090914932L, 7, "كلاريثروميسين 500mg - مرتين يومياً", null, new DateOnly(2025, 10, 2), "Pending" },
                    { 4, 29805080931412L, 2, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", null, new DateOnly(2025, 7, 20), "Pending" },
                    { 5, 26307020364649L, 2, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", null, new DateOnly(2025, 2, 6), "Pending" },
                    { 6, 25809132024142L, 8, "دكساميثازون 4mg - حسب تعليمات الطبيب", 3, new DateOnly(2025, 2, 4), "Dispensed" },
                    { 7, 26201062453818L, 4, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", 2, new DateOnly(2025, 11, 22), "Dispensed" },
                    { 8, 30502011419048L, 2, "أتورفاستاتين 20mg - مرة يومياً", null, new DateOnly(2025, 8, 24), "Pending" },
                    { 9, 29605240851446L, 8, "ميتفورمين 500mg - مرتين يومياً مع الأكل", 1, new DateOnly(2025, 6, 10), "Dispensed" },
                    { 10, 26905271342436L, 1, "كلاريثروميسين 500mg - مرتين يومياً", 1, new DateOnly(2025, 9, 2), "Dispensed" },
                    { 11, 28210090312938L, 2, "أملوديبين 5mg - مرة يومياً", null, new DateOnly(2025, 6, 11), "Pending" },
                    { 12, 26703070444031L, 3, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 4, new DateOnly(2025, 2, 23), "Dispensed" },
                    { 13, 25805240820423L, 2, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", null, new DateOnly(2025, 2, 9), "Pending" },
                    { 14, 28109171082233L, 4, "باراسيتامول 500mg - عند الحاجة", 3, new DateOnly(2025, 6, 17), "Dispensed" },
                    { 15, 28112070413428L, 7, "أوميبرازول 20mg - مرة يومياً قبل الأكل", null, new DateOnly(2025, 5, 8), "Pending" },
                    { 16, 26010242196741L, 8, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", 4, new DateOnly(2025, 4, 5), "Dispensed" },
                    { 17, 26210182474616L, 8, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", 1, new DateOnly(2025, 2, 3), "Dispensed" },
                    { 18, 27809150890235L, 6, "سيتيريزين 10mg - مرة يومياً للحساسية", 4, new DateOnly(2025, 10, 10), "Dispensed" },
                    { 19, 26403050919049L, 4, "باراسيتامول 500mg - عند الحاجة", 2, new DateOnly(2025, 12, 23), "Dispensed" },
                    { 20, 29001230483217L, 4, "أوميبرازول 20mg - مرة يومياً قبل الأكل", null, new DateOnly(2025, 11, 3), "Pending" },
                    { 21, 27110191267934L, 6, "سيتيريزين 10mg - مرة يومياً للحساسية", 4, new DateOnly(2025, 12, 8), "Dispensed" },
                    { 22, 27604031098342L, 3, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", 1, new DateOnly(2025, 5, 7), "Dispensed" },
                    { 23, 27106162792029L, 8, "أتورفاستاتين 20mg - مرة يومياً", 2, new DateOnly(2025, 1, 23), "Dispensed" },
                    { 24, 26209092311726L, 3, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", null, new DateOnly(2025, 8, 23), "Pending" },
                    { 25, 28910080232534L, 5, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", null, new DateOnly(2025, 8, 1), "Pending" },
                    { 26, 26710050560525L, 7, "ميتفورمين 500mg - مرتين يومياً مع الأكل", 1, new DateOnly(2025, 4, 5), "Dispensed" },
                    { 27, 29004151684228L, 2, "سيتيريزين 10mg - مرة يومياً للحساسية", 2, new DateOnly(2025, 4, 17), "Dispensed" },
                    { 28, 25507071264728L, 3, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", 4, new DateOnly(2025, 4, 2), "Dispensed" },
                    { 29, 27909242476921L, 5, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", null, new DateOnly(2025, 9, 16), "Pending" },
                    { 30, 28701152135649L, 6, "سيتيريزين 10mg - مرة يومياً للحساسية", 1, new DateOnly(2025, 12, 21), "Dispensed" },
                    { 31, 26509160450543L, 1, "دكساميثازون 4mg - حسب تعليمات الطبيب", 4, new DateOnly(2025, 1, 23), "Dispensed" },
                    { 32, 26103191967218L, 1, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 3, new DateOnly(2025, 5, 11), "Dispensed" },
                    { 33, 26606212365548L, 1, "سيتيريزين 10mg - مرة يومياً للحساسية", null, new DateOnly(2025, 12, 11), "Pending" },
                    { 34, 28211182366018L, 2, "كلاريثروميسين 500mg - مرتين يومياً", 2, new DateOnly(2025, 2, 19), "Dispensed" },
                    { 35, 25707260961746L, 4, "باراسيتامول 500mg - عند الحاجة", 1, new DateOnly(2025, 7, 22), "Dispensed" },
                    { 36, 26911102765112L, 6, "أوميبرازول 20mg - مرة يومياً قبل الأكل", null, new DateOnly(2025, 9, 26), "Pending" },
                    { 37, 29211271336524L, 2, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 2, new DateOnly(2025, 8, 4), "Dispensed" },
                    { 38, 26601230933711L, 6, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 1, new DateOnly(2025, 3, 14), "Dispensed" },
                    { 39, 26509130297918L, 8, "ميتفورمين 500mg - مرتين يومياً مع الأكل", 2, new DateOnly(2025, 3, 12), "Dispensed" },
                    { 40, 27003251965448L, 6, "أتورفاستاتين 20mg - مرة يومياً", 1, new DateOnly(2025, 12, 10), "Dispensed" },
                    { 41, 27605182799835L, 3, "باراسيتامول 500mg - عند الحاجة", 1, new DateOnly(2025, 4, 2), "Dispensed" },
                    { 42, 29511200559448L, 7, "سيتيريزين 10mg - مرة يومياً للحساسية", 1, new DateOnly(2025, 10, 12), "Dispensed" },
                    { 43, 29309181152935L, 7, "كلاريثروميسين 500mg - مرتين يومياً", 4, new DateOnly(2025, 8, 5), "Dispensed" },
                    { 44, 27510081922745L, 1, "سيتيريزين 10mg - مرة يومياً للحساسية", null, new DateOnly(2025, 12, 14), "Pending" },
                    { 45, 25904102727424L, 2, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 1, new DateOnly(2025, 1, 1), "Dispensed" },
                    { 46, 27812022235017L, 7, "دكساميثازون 4mg - حسب تعليمات الطبيب", 2, new DateOnly(2025, 2, 1), "Dispensed" },
                    { 47, 26209180710143L, 5, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 1, new DateOnly(2025, 12, 16), "Dispensed" },
                    { 48, 28210090312938L, 2, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", null, new DateOnly(2025, 4, 17), "Pending" },
                    { 49, 29903262470515L, 1, "أملوديبين 5mg - مرة يومياً", 3, new DateOnly(2025, 4, 5), "Dispensed" },
                    { 50, 26007120337426L, 1, "أملوديبين 5mg - مرة يومياً", 3, new DateOnly(2025, 10, 25), "Dispensed" },
                    { 51, 26704012644443L, 6, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 3, new DateOnly(2025, 1, 13), "Dispensed" },
                    { 52, 26705181427449L, 6, "ميتفورمين 500mg - مرتين يومياً مع الأكل", 1, new DateOnly(2025, 10, 23), "Dispensed" },
                    { 53, 26604102257635L, 1, "باراسيتامول 500mg - عند الحاجة", null, new DateOnly(2025, 8, 7), "Pending" },
                    { 54, 28606280831448L, 8, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", 2, new DateOnly(2025, 9, 10), "Dispensed" },
                    { 55, 28108270433316L, 1, "أوميبرازول 20mg - مرة يومياً قبل الأكل", 4, new DateOnly(2025, 10, 11), "Dispensed" },
                    { 56, 25911222551648L, 1, "سيتيريزين 10mg - مرة يومياً للحساسية", 1, new DateOnly(2025, 7, 28), "Dispensed" },
                    { 57, 28309012086142L, 8, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", 1, new DateOnly(2025, 11, 27), "Dispensed" },
                    { 58, 25606111335012L, 6, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 3, new DateOnly(2025, 5, 25), "Dispensed" },
                    { 59, 29305112434533L, 8, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 2, new DateOnly(2025, 8, 25), "Dispensed" },
                    { 60, 28604091424335L, 8, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", 3, new DateOnly(2025, 11, 5), "Dispensed" },
                    { 61, 28103171378429L, 6, "دكساميثازون 4mg - حسب تعليمات الطبيب", 4, new DateOnly(2025, 3, 5), "Dispensed" },
                    { 62, 29502200562115L, 8, "كلاريثروميسين 500mg - مرتين يومياً", 2, new DateOnly(2025, 4, 5), "Dispensed" },
                    { 63, 30402041591623L, 2, "ميتفورمين 500mg - مرتين يومياً مع الأكل", null, new DateOnly(2025, 6, 9), "Pending" },
                    { 64, 29906171167018L, 1, "سيتيريزين 10mg - مرة يومياً للحساسية", 3, new DateOnly(2025, 4, 28), "Dispensed" },
                    { 65, 29401140884613L, 6, "ميتفورمين 500mg - مرتين يومياً مع الأكل", 1, new DateOnly(2025, 5, 20), "Dispensed" },
                    { 66, 26311211430532L, 6, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 3, new DateOnly(2025, 10, 16), "Dispensed" },
                    { 67, 26401090945534L, 8, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", 2, new DateOnly(2025, 4, 26), "Dispensed" },
                    { 68, 28101151960738L, 2, "ميتفورمين 500mg - مرتين يومياً مع الأكل", 1, new DateOnly(2025, 9, 3), "Dispensed" },
                    { 69, 29710152380223L, 4, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", 2, new DateOnly(2025, 7, 2), "Dispensed" },
                    { 70, 27010030881513L, 4, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 2, new DateOnly(2025, 5, 5), "Dispensed" },
                    { 71, 25609150911841L, 7, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 4, new DateOnly(2025, 11, 25), "Dispensed" },
                    { 72, 29606190935334L, 2, "أتورفاستاتين 20mg - مرة يومياً", 3, new DateOnly(2025, 1, 16), "Dispensed" },
                    { 73, 28412052161645L, 5, "أملوديبين 5mg - مرة يومياً", null, new DateOnly(2025, 2, 16), "Pending" },
                    { 74, 27402190215935L, 2, "أتورفاستاتين 20mg - مرة يومياً", 1, new DateOnly(2025, 7, 23), "Dispensed" },
                    { 75, 27511261744633L, 1, "سيتيريزين 10mg - مرة يومياً للحساسية", 4, new DateOnly(2025, 6, 21), "Dispensed" },
                    { 76, 30412130970331L, 7, "كلاريثروميسين 500mg - مرتين يومياً", 4, new DateOnly(2025, 7, 5), "Dispensed" },
                    { 77, 27911070557216L, 7, "كلاريثروميسين 500mg - مرتين يومياً", 2, new DateOnly(2025, 9, 15), "Dispensed" },
                    { 78, 27204041387323L, 5, "باراسيتامول 500mg - عند الحاجة", 1, new DateOnly(2025, 7, 11), "Dispensed" },
                    { 79, 29701151597241L, 3, "أتورفاستاتين 20mg - مرة يومياً", 4, new DateOnly(2025, 11, 9), "Dispensed" },
                    { 80, 25904012281337L, 8, "دكساميثازون 4mg - حسب تعليمات الطبيب", 3, new DateOnly(2025, 5, 25), "Dispensed" },
                    { 81, 29205130926512L, 8, "أتورفاستاتين 20mg - مرة يومياً", 4, new DateOnly(2025, 4, 6), "Dispensed" },
                    { 82, 26710060835422L, 7, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 4, new DateOnly(2025, 12, 21), "Dispensed" },
                    { 83, 29502200562115L, 8, "دكساميثازون 4mg - حسب تعليمات الطبيب", null, new DateOnly(2025, 1, 21), "Pending" },
                    { 84, 27510041789444L, 1, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", null, new DateOnly(2025, 5, 12), "Pending" },
                    { 85, 27102181731443L, 4, "أملوديبين 5mg - مرة يومياً", null, new DateOnly(2025, 4, 10), "Pending" },
                    { 86, 26606212365548L, 1, "باراسيتامول 500mg - عند الحاجة", 4, new DateOnly(2025, 11, 17), "Dispensed" },
                    { 87, 28312052272832L, 7, "كلاريثروميسين 500mg - مرتين يومياً", 2, new DateOnly(2025, 2, 9), "Dispensed" },
                    { 88, 26003102010546L, 1, "سيتيريزين 10mg - مرة يومياً للحساسية", 1, new DateOnly(2025, 7, 24), "Dispensed" },
                    { 89, 29607110985423L, 8, "أوميبرازول 20mg - مرة يومياً قبل الأكل", 2, new DateOnly(2025, 4, 1), "Dispensed" },
                    { 90, 26001251776233L, 1, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 4, new DateOnly(2025, 11, 10), "Dispensed" },
                    { 91, 27904202293424L, 1, "كلاريثروميسين 500mg - مرتين يومياً", null, new DateOnly(2025, 4, 28), "Pending" },
                    { 92, 27001270566649L, 4, "ميتفورمين 500mg - مرتين يومياً مع الأكل", null, new DateOnly(2025, 4, 28), "Pending" },
                    { 93, 25911201723239L, 8, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", null, new DateOnly(2025, 8, 10), "Pending" },
                    { 94, 28201050321836L, 3, "كلاريثروميسين 500mg - مرتين يومياً", null, new DateOnly(2025, 11, 13), "Pending" },
                    { 95, 26601230933711L, 6, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 3, new DateOnly(2025, 2, 9), "Dispensed" },
                    { 96, 25805240820423L, 2, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", null, new DateOnly(2025, 4, 13), "Pending" },
                    { 97, 26310271920812L, 8, "باراسيتامول 500mg - عند الحاجة", null, new DateOnly(2025, 2, 4), "Pending" },
                    { 98, 26712172611438L, 4, "دكساميثازون 4mg - حسب تعليمات الطبيب", 1, new DateOnly(2025, 6, 15), "Dispensed" },
                    { 99, 26101111663415L, 2, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 4, new DateOnly(2025, 3, 8), "Dispensed" },
                    { 100, 29402051031646L, 3, "أملوديبين 5mg - مرة يومياً", 4, new DateOnly(2025, 1, 10), "Dispensed" },
                    { 101, 26509160450543L, 1, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 2, new DateOnly(2025, 6, 3), "Dispensed" },
                    { 102, 29207252239815L, 4, "سيتيريزين 10mg - مرة يومياً للحساسية", 2, new DateOnly(2025, 11, 8), "Dispensed" },
                    { 103, 26401090871233L, 3, "أملوديبين 5mg - مرة يومياً", 2, new DateOnly(2025, 1, 5), "Dispensed" },
                    { 104, 26601172079928L, 6, "أوميبرازول 20mg - مرة يومياً قبل الأكل", null, new DateOnly(2025, 6, 5), "Pending" },
                    { 105, 25802082334821L, 4, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 2, new DateOnly(2025, 10, 5), "Dispensed" },
                    { 106, 25911011421642L, 5, "ميتفورمين 500mg - مرتين يومياً مع الأكل", 4, new DateOnly(2025, 5, 2), "Dispensed" },
                    { 107, 27511261744633L, 1, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", 4, new DateOnly(2025, 8, 5), "Dispensed" },
                    { 108, 29210181337133L, 3, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 2, new DateOnly(2025, 1, 7), "Dispensed" },
                    { 109, 29307172516614L, 2, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 3, new DateOnly(2025, 5, 21), "Dispensed" },
                    { 110, 27903231064334L, 3, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", 1, new DateOnly(2025, 10, 5), "Dispensed" },
                    { 111, 27105110133048L, 4, "دكساميثازون 4mg - حسب تعليمات الطبيب", 4, new DateOnly(2025, 7, 15), "Dispensed" },
                    { 112, 27010030881513L, 4, "أوميبرازول 20mg - مرة يومياً قبل الأكل", 1, new DateOnly(2025, 4, 10), "Dispensed" },
                    { 113, 26404161084839L, 4, "باراسيتامول 500mg - عند الحاجة", 2, new DateOnly(2025, 2, 23), "Dispensed" },
                    { 114, 28310131632728L, 3, "كلاريثروميسين 500mg - مرتين يومياً", 1, new DateOnly(2025, 2, 23), "Dispensed" },
                    { 115, 27102181731443L, 4, "باراسيتامول 500mg - عند الحاجة", null, new DateOnly(2025, 12, 17), "Pending" },
                    { 116, 25501050850712L, 6, "دكساميثازون 4mg - حسب تعليمات الطبيب", null, new DateOnly(2025, 3, 6), "Pending" },
                    { 117, 29511200559448L, 7, "باراسيتامول 500mg - عند الحاجة", 1, new DateOnly(2025, 9, 19), "Dispensed" },
                    { 118, 26012032527324L, 6, "دكساميثازون 4mg - حسب تعليمات الطبيب", 4, new DateOnly(2025, 2, 5), "Dispensed" },
                    { 119, 26907131787138L, 1, "أوميبرازول 20mg - مرة يومياً قبل الأكل", null, new DateOnly(2025, 6, 16), "Pending" },
                    { 120, 29205121611912L, 4, "كلاريثروميسين 500mg - مرتين يومياً", 2, new DateOnly(2025, 5, 8), "Dispensed" },
                    { 121, 29006262341429L, 7, "سيتيريزين 10mg - مرة يومياً للحساسية", null, new DateOnly(2025, 5, 28), "Pending" },
                    { 122, 26501201167834L, 4, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", null, new DateOnly(2025, 8, 16), "Pending" },
                    { 123, 26412030877225L, 2, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", null, new DateOnly(2025, 10, 20), "Pending" },
                    { 124, 29004151684228L, 2, "أملوديبين 5mg - مرة يومياً", 4, new DateOnly(2025, 10, 24), "Dispensed" },
                    { 125, 28701152135649L, 6, "دكساميثازون 4mg - حسب تعليمات الطبيب", null, new DateOnly(2025, 3, 7), "Pending" },
                    { 126, 27212100555541L, 1, "أتورفاستاتين 20mg - مرة يومياً", null, new DateOnly(2025, 1, 28), "Pending" },
                    { 127, 25809132024142L, 8, "سيتيريزين 10mg - مرة يومياً للحساسية", 3, new DateOnly(2025, 9, 4), "Dispensed" },
                    { 128, 26802200544638L, 2, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", null, new DateOnly(2025, 10, 16), "Pending" },
                    { 129, 25906261624719L, 5, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", 2, new DateOnly(2025, 9, 14), "Dispensed" },
                    { 130, 27105110133048L, 4, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 3, new DateOnly(2025, 12, 28), "Dispensed" },
                    { 131, 27211090914932L, 7, "سيتيريزين 10mg - مرة يومياً للحساسية", 2, new DateOnly(2025, 9, 17), "Dispensed" },
                    { 132, 29609162011614L, 8, "دكساميثازون 4mg - حسب تعليمات الطبيب", 2, new DateOnly(2025, 3, 11), "Dispensed" },
                    { 133, 25701281884041L, 6, "باراسيتامول 500mg - عند الحاجة", 1, new DateOnly(2025, 7, 2), "Dispensed" },
                    { 134, 29705131626346L, 8, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", 1, new DateOnly(2025, 8, 20), "Dispensed" },
                    { 135, 25911201723239L, 8, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 4, new DateOnly(2025, 1, 28), "Dispensed" },
                    { 136, 26202071747247L, 2, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 1, new DateOnly(2025, 2, 12), "Dispensed" },
                    { 137, 27503110764434L, 6, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", 4, new DateOnly(2025, 5, 7), "Dispensed" },
                    { 138, 28406122061644L, 4, "أملوديبين 5mg - مرة يومياً", 4, new DateOnly(2025, 5, 17), "Dispensed" },
                    { 139, 28207160311936L, 8, "سيتيريزين 10mg - مرة يومياً للحساسية", null, new DateOnly(2025, 10, 12), "Pending" },
                    { 140, 29105272661018L, 1, "دكساميثازون 4mg - حسب تعليمات الطبيب", 3, new DateOnly(2025, 10, 27), "Dispensed" },
                    { 141, 27205221217229L, 3, "دكساميثازون 4mg - حسب تعليمات الطبيب", 2, new DateOnly(2025, 5, 22), "Dispensed" },
                    { 142, 28304251063124L, 1, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 1, new DateOnly(2025, 6, 7), "Dispensed" },
                    { 143, 28205142294615L, 6, "أوميبرازول 20mg - مرة يومياً قبل الأكل", 4, new DateOnly(2025, 6, 10), "Dispensed" },
                    { 144, 26507262312143L, 1, "كلاريثروميسين 500mg - مرتين يومياً", null, new DateOnly(2025, 10, 16), "Pending" },
                    { 145, 26601172079928L, 6, "ميتفورمين 500mg - مرتين يومياً مع الأكل", 3, new DateOnly(2025, 5, 7), "Dispensed" },
                    { 146, 29602101223226L, 5, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", 2, new DateOnly(2025, 6, 1), "Dispensed" },
                    { 147, 29408171411944L, 6, "أتورفاستاتين 20mg - مرة يومياً", 4, new DateOnly(2025, 6, 16), "Dispensed" },
                    { 148, 28707022693816L, 1, "سيتيريزين 10mg - مرة يومياً للحساسية", null, new DateOnly(2025, 7, 11), "Pending" },
                    { 149, 29309181152935L, 7, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", 3, new DateOnly(2025, 3, 25), "Dispensed" },
                    { 150, 26209092311726L, 3, "ميتفورمين 500mg - مرتين يومياً مع الأكل", 4, new DateOnly(2025, 4, 14), "Dispensed" },
                    { 151, 29903171168426L, 4, "أملوديبين 5mg - مرة يومياً", 3, new DateOnly(2025, 9, 5), "Dispensed" },
                    { 152, 28712041974029L, 1, "أملوديبين 5mg - مرة يومياً", 4, new DateOnly(2025, 11, 14), "Dispensed" },
                    { 153, 29707182119014L, 7, "باراسيتامول 500mg - عند الحاجة", 4, new DateOnly(2025, 3, 15), "Dispensed" },
                    { 154, 27911070557216L, 7, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", 3, new DateOnly(2025, 4, 13), "Dispensed" },
                    { 155, 26105142352636L, 7, "دكساميثازون 4mg - حسب تعليمات الطبيب", null, new DateOnly(2025, 10, 4), "Pending" },
                    { 156, 28108270433316L, 1, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", 2, new DateOnly(2025, 7, 17), "Dispensed" },
                    { 157, 30504072762928L, 8, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", 1, new DateOnly(2025, 11, 17), "Dispensed" },
                    { 158, 28612021557035L, 3, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 1, new DateOnly(2025, 11, 10), "Dispensed" },
                    { 159, 29809162071039L, 1, "سيتيريزين 10mg - مرة يومياً للحساسية", null, new DateOnly(2025, 7, 21), "Pending" },
                    { 160, 28810112499039L, 6, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", 2, new DateOnly(2025, 4, 9), "Dispensed" },
                    { 161, 28907162425713L, 3, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", null, new DateOnly(2025, 8, 28), "Pending" },
                    { 162, 25601051694214L, 2, "أملوديبين 5mg - مرة يومياً", 4, new DateOnly(2025, 4, 7), "Dispensed" },
                    { 163, 28310150453012L, 7, "ميتفورمين 500mg - مرتين يومياً مع الأكل", 2, new DateOnly(2025, 4, 4), "Dispensed" },
                    { 164, 29607110985423L, 8, "باراسيتامول 500mg - عند الحاجة", 3, new DateOnly(2025, 4, 19), "Dispensed" },
                    { 165, 28604091424335L, 8, "سيتيريزين 10mg - مرة يومياً للحساسية", null, new DateOnly(2025, 5, 3), "Pending" },
                    { 166, 30504281489635L, 8, "ميتفورمين 500mg - مرتين يومياً مع الأكل", 3, new DateOnly(2025, 11, 16), "Dispensed" },
                    { 167, 25601190374917L, 6, "أتورفاستاتين 20mg - مرة يومياً", 3, new DateOnly(2025, 4, 28), "Dispensed" },
                    { 168, 27611162373234L, 4, "باراسيتامول 500mg - عند الحاجة", 3, new DateOnly(2025, 9, 3), "Dispensed" },
                    { 169, 27708250891123L, 4, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 3, new DateOnly(2025, 2, 17), "Dispensed" },
                    { 170, 25701281884041L, 6, "أملوديبين 5mg - مرة يومياً", 4, new DateOnly(2025, 9, 23), "Dispensed" },
                    { 171, 28208070953031L, 3, "أوميبرازول 20mg - مرة يومياً قبل الأكل", 2, new DateOnly(2025, 2, 16), "Dispensed" },
                    { 172, 27312052010538L, 7, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 4, new DateOnly(2025, 9, 7), "Dispensed" },
                    { 173, 28903280265834L, 4, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", null, new DateOnly(2025, 1, 27), "Pending" },
                    { 174, 27510041789444L, 1, "سيتيريزين 10mg - مرة يومياً للحساسية", 3, new DateOnly(2025, 5, 12), "Dispensed" },
                    { 175, 28211182366018L, 2, "أتورفاستاتين 20mg - مرة يومياً", null, new DateOnly(2025, 3, 1), "Pending" },
                    { 176, 30512110377845L, 5, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", null, new DateOnly(2025, 11, 19), "Pending" },
                    { 177, 26704012644443L, 6, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", null, new DateOnly(2025, 2, 17), "Pending" },
                    { 178, 27212100555541L, 1, "ميتفورمين 500mg - مرتين يومياً مع الأكل", null, new DateOnly(2025, 7, 10), "Pending" },
                    { 179, 29710152380223L, 4, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", 3, new DateOnly(2025, 4, 15), "Dispensed" },
                    { 180, 27106162792029L, 8, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", null, new DateOnly(2025, 5, 22), "Pending" },
                    { 181, 26906132195932L, 7, "دكساميثازون 4mg - حسب تعليمات الطبيب", 4, new DateOnly(2025, 12, 2), "Dispensed" },
                    { 182, 26012032527324L, 6, "باراسيتامول 500mg - عند الحاجة", null, new DateOnly(2025, 9, 13), "Pending" },
                    { 183, 25912210595421L, 8, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 3, new DateOnly(2025, 12, 21), "Dispensed" },
                    { 184, 27812230127946L, 5, "سيتيريزين 10mg - مرة يومياً للحساسية", 4, new DateOnly(2025, 2, 20), "Dispensed" },
                    { 185, 29707182119014L, 7, "أوميبرازول 20mg - مرة يومياً قبل الأكل", 1, new DateOnly(2025, 1, 19), "Dispensed" },
                    { 186, 26712220578842L, 1, "دكساميثازون 4mg - حسب تعليمات الطبيب", 4, new DateOnly(2025, 6, 22), "Dispensed" },
                    { 187, 29902021581915L, 4, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 1, new DateOnly(2025, 12, 18), "Dispensed" },
                    { 188, 26606212365548L, 1, "دكساميثازون 4mg - حسب تعليمات الطبيب", 3, new DateOnly(2025, 12, 3), "Dispensed" },
                    { 189, 26201062453818L, 4, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", 1, new DateOnly(2025, 12, 11), "Dispensed" },
                    { 190, 26505122626923L, 6, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", null, new DateOnly(2025, 3, 23), "Pending" },
                    { 191, 26903011925532L, 5, "أملوديبين 5mg - مرة يومياً", 2, new DateOnly(2025, 8, 14), "Dispensed" },
                    { 192, 29104150934231L, 6, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", 1, new DateOnly(2025, 8, 12), "Dispensed" },
                    { 193, 25908202772935L, 5, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", 1, new DateOnly(2025, 12, 27), "Dispensed" },
                    { 194, 29305112434533L, 8, "أتورفاستاتين 20mg - مرة يومياً", 1, new DateOnly(2025, 4, 2), "Dispensed" },
                    { 195, 27809091141226L, 2, "باراسيتامول 500mg - عند الحاجة", 1, new DateOnly(2025, 12, 27), "Dispensed" },
                    { 196, 30408110458418L, 4, "دكساميثازون 4mg - حسب تعليمات الطبيب", 2, new DateOnly(2025, 2, 10), "Dispensed" },
                    { 197, 26303212559348L, 5, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 2, new DateOnly(2025, 3, 11), "Dispensed" },
                    { 198, 30406152649934L, 4, "دكساميثازون 4mg - حسب تعليمات الطبيب", 4, new DateOnly(2025, 8, 17), "Dispensed" },
                    { 199, 27911070557216L, 7, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", null, new DateOnly(2025, 10, 14), "Pending" },
                    { 200, 29604192279134L, 8, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 2, new DateOnly(2025, 7, 7), "Dispensed" },
                    { 201, 28310131632728L, 3, "دكساميثازون 4mg - حسب تعليمات الطبيب", null, new DateOnly(2025, 6, 4), "Pending" },
                    { 202, 29711141255012L, 4, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 1, new DateOnly(2025, 2, 4), "Dispensed" },
                    { 203, 27708250891123L, 4, "أملوديبين 5mg - مرة يومياً", 2, new DateOnly(2025, 10, 3), "Dispensed" },
                    { 204, 30512242187043L, 2, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", null, new DateOnly(2025, 10, 24), "Pending" },
                    { 205, 27007171823145L, 8, "باراسيتامول 500mg - عند الحاجة", 1, new DateOnly(2025, 6, 27), "Dispensed" },
                    { 206, 26812010695916L, 4, "باراسيتامول 500mg - عند الحاجة", 4, new DateOnly(2025, 6, 26), "Dispensed" },
                    { 207, 28606281562033L, 6, "سيتيريزين 10mg - مرة يومياً للحساسية", 2, new DateOnly(2025, 3, 2), "Dispensed" },
                    { 208, 27212100555541L, 1, "سيتيريزين 10mg - مرة يومياً للحساسية", null, new DateOnly(2025, 8, 13), "Pending" },
                    { 209, 27911070557216L, 7, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", null, new DateOnly(2025, 4, 23), "Pending" },
                    { 210, 26102161683017L, 4, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 3, new DateOnly(2025, 5, 2), "Dispensed" },
                    { 211, 26704012644443L, 6, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", null, new DateOnly(2025, 6, 11), "Pending" },
                    { 212, 28907181573718L, 1, "أملوديبين 5mg - مرة يومياً", 2, new DateOnly(2025, 8, 2), "Dispensed" },
                    { 213, 29906171167018L, 1, "أملوديبين 5mg - مرة يومياً", 3, new DateOnly(2025, 9, 17), "Dispensed" },
                    { 214, 28010051198022L, 3, "سيتيريزين 10mg - مرة يومياً للحساسية", 2, new DateOnly(2025, 11, 19), "Dispensed" },
                    { 215, 25910271883016L, 5, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", null, new DateOnly(2025, 7, 19), "Pending" },
                    { 216, 26903240593732L, 4, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", 4, new DateOnly(2025, 3, 27), "Dispensed" },
                    { 217, 26304081958943L, 1, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", 1, new DateOnly(2025, 2, 12), "Dispensed" },
                    { 218, 30210112797917L, 2, "أتورفاستاتين 20mg - مرة يومياً", 1, new DateOnly(2025, 1, 28), "Dispensed" },
                    { 219, 26710050560525L, 7, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", 2, new DateOnly(2025, 1, 3), "Dispensed" },
                    { 220, 26404161084839L, 4, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", 4, new DateOnly(2025, 12, 19), "Dispensed" },
                    { 221, 30509241483728L, 8, "كلاريثروميسين 500mg - مرتين يومياً", 1, new DateOnly(2025, 10, 3), "Dispensed" },
                    { 222, 26004251794235L, 8, "باراسيتامول 500mg - عند الحاجة", 4, new DateOnly(2025, 1, 12), "Dispensed" },
                    { 223, 25910191374939L, 1, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", 4, new DateOnly(2025, 3, 14), "Dispensed" },
                    { 224, 29807060933612L, 8, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 1, new DateOnly(2025, 9, 9), "Dispensed" },
                    { 225, 30311020977349L, 3, "كلاريثروميسين 500mg - مرتين يومياً", null, new DateOnly(2025, 5, 6), "Pending" },
                    { 226, 29011272346948L, 8, "ميتفورمين 500mg - مرتين يومياً مع الأكل", 1, new DateOnly(2025, 3, 6), "Dispensed" },
                    { 227, 27411052118146L, 8, "أوميبرازول 20mg - مرة يومياً قبل الأكل", 3, new DateOnly(2025, 11, 4), "Dispensed" },
                    { 228, 26209180710143L, 5, "باراسيتامول 500mg - عند الحاجة", null, new DateOnly(2025, 4, 12), "Pending" },
                    { 229, 26311211430532L, 6, "ميتفورمين 500mg - مرتين يومياً مع الأكل", 4, new DateOnly(2025, 3, 9), "Dispensed" },
                    { 230, 29304222143823L, 7, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", null, new DateOnly(2025, 9, 6), "Pending" },
                    { 231, 29602061327126L, 8, "دكساميثازون 4mg - حسب تعليمات الطبيب", 4, new DateOnly(2025, 8, 21), "Dispensed" },
                    { 232, 28208070953031L, 3, "دكساميثازون 4mg - حسب تعليمات الطبيب", null, new DateOnly(2025, 1, 19), "Pending" },
                    { 233, 29607110985423L, 8, "أوميبرازول 20mg - مرة يومياً قبل الأكل", 4, new DateOnly(2025, 6, 11), "Dispensed" },
                    { 234, 29604192279134L, 8, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 3, new DateOnly(2025, 9, 26), "Dispensed" },
                    { 235, 27310072633431L, 5, "ميتفورمين 500mg - مرتين يومياً مع الأكل", 2, new DateOnly(2025, 5, 4), "Dispensed" },
                    { 236, 28708270328423L, 4, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", 3, new DateOnly(2025, 6, 23), "Dispensed" },
                    { 237, 30211281664546L, 7, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 1, new DateOnly(2025, 9, 14), "Dispensed" },
                    { 238, 26710060835422L, 7, "سيتيريزين 10mg - مرة يومياً للحساسية", 2, new DateOnly(2025, 2, 1), "Dispensed" },
                    { 239, 27510041789444L, 1, "أملوديبين 5mg - مرة يومياً", 3, new DateOnly(2025, 5, 18), "Dispensed" },
                    { 240, 25606111335012L, 6, "دكساميثازون 4mg - حسب تعليمات الطبيب", 2, new DateOnly(2025, 10, 4), "Dispensed" },
                    { 241, 25601190374917L, 6, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", 1, new DateOnly(2025, 3, 8), "Dispensed" },
                    { 242, 25802082334821L, 4, "أتورفاستاتين 20mg - مرة يومياً", 3, new DateOnly(2025, 2, 10), "Dispensed" },
                    { 243, 27408252696237L, 5, "سيتيريزين 10mg - مرة يومياً للحساسية", 1, new DateOnly(2025, 3, 10), "Dispensed" },
                    { 244, 27007121572627L, 4, "أملوديبين 5mg - مرة يومياً", 2, new DateOnly(2025, 2, 20), "Dispensed" },
                    { 245, 27301192714834L, 7, "ميتفورمين 500mg - مرتين يومياً مع الأكل", 2, new DateOnly(2025, 3, 10), "Dispensed" },
                    { 246, 29211271336524L, 2, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 4, new DateOnly(2025, 3, 5), "Dispensed" },
                    { 247, 29507171411419L, 7, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 4, new DateOnly(2025, 5, 16), "Dispensed" },
                    { 248, 29304071192438L, 3, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", 3, new DateOnly(2025, 9, 13), "Dispensed" },
                    { 249, 29309181152935L, 7, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", null, new DateOnly(2025, 3, 19), "Pending" },
                    { 250, 25706241388934L, 6, "أتورفاستاتين 20mg - مرة يومياً", 4, new DateOnly(2025, 4, 11), "Dispensed" },
                    { 251, 29810110723133L, 4, "دكساميثازون 4mg - حسب تعليمات الطبيب", null, new DateOnly(2025, 10, 6), "Pending" },
                    { 252, 25910170263539L, 3, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 2, new DateOnly(2025, 7, 11), "Dispensed" },
                    { 253, 28706272661928L, 6, "دكساميثازون 4mg - حسب تعليمات الطبيب", null, new DateOnly(2025, 4, 7), "Pending" },
                    { 254, 30512182354842L, 5, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 3, new DateOnly(2025, 8, 20), "Dispensed" },
                    { 255, 27505062553044L, 5, "كلاريثروميسين 500mg - مرتين يومياً", 3, new DateOnly(2025, 9, 21), "Dispensed" },
                    { 256, 29911162058212L, 7, "أملوديبين 5mg - مرة يومياً", 4, new DateOnly(2025, 2, 24), "Dispensed" },
                    { 257, 27609081887333L, 4, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", 1, new DateOnly(2025, 2, 20), "Dispensed" },
                    { 258, 28404160791449L, 5, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", null, new DateOnly(2025, 7, 6), "Pending" },
                    { 259, 27107201080846L, 2, "دكساميثازون 4mg - حسب تعليمات الطبيب", 3, new DateOnly(2025, 9, 18), "Dispensed" },
                    { 260, 26207070450518L, 7, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", 2, new DateOnly(2025, 10, 10), "Dispensed" },
                    { 261, 29805050237031L, 2, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 1, new DateOnly(2025, 12, 24), "Dispensed" },
                    { 262, 28109140485342L, 3, "أملوديبين 5mg - مرة يومياً", 2, new DateOnly(2025, 3, 2), "Dispensed" },
                    { 263, 26305201632248L, 5, "كلاريثروميسين 500mg - مرتين يومياً", 1, new DateOnly(2025, 3, 17), "Dispensed" },
                    { 264, 29509201483533L, 1, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 1, new DateOnly(2025, 11, 9), "Dispensed" },
                    { 265, 27301211520721L, 3, "أتورفاستاتين 20mg - مرة يومياً", null, new DateOnly(2025, 12, 16), "Pending" },
                    { 266, 27211090914932L, 7, "كلاريثروميسين 500mg - مرتين يومياً", 2, new DateOnly(2025, 9, 15), "Dispensed" },
                    { 267, 28907162425713L, 3, "أموكسيسيلين 500mg - 3 مرات يومياً لـ 7 أيام", 2, new DateOnly(2025, 9, 14), "Dispensed" },
                    { 268, 25609150911841L, 7, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", null, new DateOnly(2025, 5, 13), "Pending" },
                    { 269, 27509110737632L, 7, "أملوديبين 5mg - مرة يومياً", 3, new DateOnly(2025, 5, 10), "Dispensed" },
                    { 270, 28303242043947L, 2, "أتورفاستاتين 20mg - مرة يومياً", null, new DateOnly(2025, 5, 3), "Pending" },
                    { 271, 27304051311349L, 1, "أتورفاستاتين 20mg - مرة يومياً", 1, new DateOnly(2025, 2, 9), "Dispensed" },
                    { 272, 25707260961746L, 4, "ميتفورمين 500mg - مرتين يومياً مع الأكل", null, new DateOnly(2025, 2, 6), "Pending" },
                    { 273, 27906061966143L, 3, "دكساميثازون 4mg - حسب تعليمات الطبيب", 1, new DateOnly(2025, 5, 4), "Dispensed" },
                    { 274, 25707260961746L, 4, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", null, new DateOnly(2025, 6, 6), "Pending" },
                    { 275, 26403050919049L, 4, "كلاريثروميسين 500mg - مرتين يومياً", null, new DateOnly(2025, 3, 5), "Pending" },
                    { 276, 27511261744633L, 1, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", null, new DateOnly(2025, 4, 9), "Pending" },
                    { 277, 27402270257328L, 1, "كلاريثروميسين 500mg - مرتين يومياً", null, new DateOnly(2025, 12, 7), "Pending" },
                    { 278, 28410112142732L, 1, "سيتيريزين 10mg - مرة يومياً للحساسية", 4, new DateOnly(2025, 1, 3), "Dispensed" },
                    { 279, 29511200559448L, 7, "باراسيتامول 500mg - عند الحاجة", 1, new DateOnly(2025, 8, 4), "Dispensed" },
                    { 280, 28606280831448L, 8, "دكساميثازون 4mg - حسب تعليمات الطبيب", 2, new DateOnly(2025, 6, 16), "Dispensed" },
                    { 281, 28908152583844L, 4, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 2, new DateOnly(2025, 9, 26), "Dispensed" },
                    { 282, 25606111335012L, 6, "باراسيتامول 500mg - عند الحاجة", null, new DateOnly(2025, 7, 5), "Pending" },
                    { 283, 27306201560027L, 3, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", null, new DateOnly(2025, 5, 14), "Pending" },
                    { 284, 26903011925532L, 5, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", 2, new DateOnly(2025, 8, 28), "Dispensed" },
                    { 285, 26401090871233L, 3, "ميتفورمين 500mg - مرتين يومياً مع الأكل", null, new DateOnly(2025, 6, 21), "Pending" },
                    { 286, 29208111352836L, 8, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", 4, new DateOnly(2025, 1, 18), "Dispensed" },
                    { 287, 27604181195219L, 4, "إيبوبروفين 400mg - 3 مرات يومياً مع الأكل", 2, new DateOnly(2025, 7, 23), "Dispensed" },
                    { 288, 28406122061644L, 4, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", 3, new DateOnly(2025, 8, 10), "Dispensed" },
                    { 289, 26705181427449L, 6, "أملوديبين 5mg - مرة يومياً", 1, new DateOnly(2025, 10, 1), "Dispensed" },
                    { 290, 25609150911841L, 7, "ميتفورمين 500mg - مرتين يومياً مع الأكل", null, new DateOnly(2025, 5, 27), "Pending" },
                    { 291, 27807060786621L, 2, "باراسيتامول 500mg - عند الحاجة", 2, new DateOnly(2025, 4, 7), "Dispensed" },
                    { 292, 28208070953031L, 3, "دكساميثازون 4mg - حسب تعليمات الطبيب", 2, new DateOnly(2025, 9, 4), "Dispensed" },
                    { 293, 29011272346948L, 8, "أزيثروميسين 500mg - مرة يومياً لـ 5 أيام", 3, new DateOnly(2025, 11, 26), "Dispensed" },
                    { 294, 25911011421642L, 5, "باراسيتامول 500mg - عند الحاجة", 4, new DateOnly(2025, 5, 6), "Dispensed" },
                    { 295, 26103191967218L, 1, "دكساميثازون 4mg - حسب تعليمات الطبيب", 4, new DateOnly(2025, 12, 9), "Dispensed" },
                    { 296, 26903011925532L, 5, "مترونيدازول 500mg - 3 مرات يومياً لـ 7 أيام", null, new DateOnly(2025, 5, 28), "Pending" },
                    { 297, 29906031231545L, 1, "أتورفاستاتين 20mg - مرة يومياً", 4, new DateOnly(2025, 9, 18), "Dispensed" },
                    { 298, 29408171411944L, 6, "باراسيتامول 500mg - عند الحاجة", null, new DateOnly(2025, 9, 20), "Pending" },
                    { 299, 29205121611912L, 4, "دكساميثازون 4mg - حسب تعليمات الطبيب", 1, new DateOnly(2025, 10, 26), "Dispensed" },
                    { 300, 29705131626346L, 8, "سيتيريزين 10mg - مرة يومياً للحساسية", null, new DateOnly(2025, 4, 11), "Pending" },
                    { 301, 29207252239815L, 4, "كلاريثروميسين 500mg - مرتين يومياً", 2, new DateOnly(2025, 11, 5), "Dispensed" }
                });
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 1, 29107080694344L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 2, 28907181573718L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 3, 27211090914932L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 4, 29805080931412L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 5, 26307020364649L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 6, 25809132024142L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 7, 26201062453818L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 8, 30502011419048L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 9, 29605240851446L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 10, 26905271342436L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 11, 28210090312938L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 12, 26703070444031L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 13, 25805240820423L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 14, 28109171082233L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 15, 28112070413428L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 16, 26010242196741L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 17, 26210182474616L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 18, 27809150890235L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 19, 26403050919049L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 20, 29001230483217L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 21, 27110191267934L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 22, 27604031098342L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 23, 27106162792029L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 24, 26209092311726L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 25, 28910080232534L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 26, 26710050560525L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 27, 29004151684228L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 28, 25507071264728L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 29, 27909242476921L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 30, 28701152135649L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 31, 26509160450543L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 32, 26103191967218L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 33, 26606212365548L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 34, 28211182366018L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 35, 25707260961746L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 36, 26911102765112L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 37, 29211271336524L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 38, 26601230933711L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 39, 26509130297918L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 40, 27003251965448L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 41, 27605182799835L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 42, 29511200559448L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 43, 29309181152935L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 44, 27510081922745L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 45, 25904102727424L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 46, 27812022235017L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 47, 26209180710143L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 48, 28210090312938L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 49, 29903262470515L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 50, 26007120337426L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 51, 26704012644443L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 52, 26705181427449L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 53, 26604102257635L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 54, 28606280831448L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 55, 28108270433316L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 56, 25911222551648L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 57, 28309012086142L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 58, 25606111335012L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 59, 29305112434533L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 60, 28604091424335L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 61, 28103171378429L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 62, 29502200562115L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 63, 30402041591623L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 64, 29906171167018L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 65, 29401140884613L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 66, 26311211430532L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 67, 26401090945534L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 68, 28101151960738L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 69, 29710152380223L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 70, 27010030881513L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 71, 25609150911841L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 72, 29606190935334L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 73, 28412052161645L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 74, 27402190215935L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 75, 27511261744633L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 76, 30412130970331L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 77, 27911070557216L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 78, 27204041387323L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 79, 29701151597241L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 80, 25904012281337L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 81, 29205130926512L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 82, 26710060835422L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 83, 29502200562115L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 84, 27510041789444L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 85, 27102181731443L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 86, 26606212365548L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 87, 28312052272832L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 88, 26003102010546L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 89, 29607110985423L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 90, 26001251776233L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 91, 27904202293424L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 92, 27001270566649L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 93, 25911201723239L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 94, 28201050321836L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 95, 26601230933711L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 96, 25805240820423L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 97, 26310271920812L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 98, 26712172611438L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 99, 26101111663415L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 100, 29402051031646L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 101, 26509160450543L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 102, 29207252239815L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 103, 26401090871233L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 104, 26601172079928L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 105, 25802082334821L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 106, 25911011421642L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 107, 27511261744633L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 108, 29210181337133L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 109, 29307172516614L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 110, 27903231064334L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 111, 27105110133048L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 112, 27010030881513L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 113, 26404161084839L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 114, 28310131632728L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 115, 27102181731443L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 116, 25501050850712L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 117, 29511200559448L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 118, 26012032527324L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 119, 26907131787138L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 120, 29205121611912L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 121, 29006262341429L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 122, 26501201167834L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 123, 26412030877225L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 124, 29004151684228L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 125, 28701152135649L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 126, 27212100555541L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 127, 25809132024142L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 128, 26802200544638L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 129, 25906261624719L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 130, 27105110133048L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 131, 27211090914932L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 132, 29609162011614L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 133, 25701281884041L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 134, 29705131626346L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 135, 25911201723239L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 136, 26202071747247L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 137, 27503110764434L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 138, 28406122061644L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 139, 28207160311936L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 140, 29105272661018L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 141, 27205221217229L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 142, 28304251063124L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 143, 28205142294615L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 144, 26507262312143L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 145, 26601172079928L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 146, 29602101223226L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 147, 29408171411944L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 148, 28707022693816L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 149, 29309181152935L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 150, 26209092311726L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 151, 29903171168426L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 152, 28712041974029L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 153, 29707182119014L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 154, 27911070557216L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 155, 26105142352636L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 156, 28108270433316L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 157, 30504072762928L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 158, 28612021557035L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 159, 29809162071039L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 160, 28810112499039L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 161, 28907162425713L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 162, 25601051694214L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 163, 28310150453012L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 164, 29607110985423L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 165, 28604091424335L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 166, 30504281489635L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 167, 25601190374917L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 168, 27611162373234L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 169, 27708250891123L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 170, 25701281884041L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 171, 28208070953031L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 172, 27312052010538L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 173, 28903280265834L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 174, 27510041789444L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 175, 28211182366018L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 176, 30512110377845L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 177, 26704012644443L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 178, 27212100555541L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 179, 29710152380223L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 180, 27106162792029L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 181, 26906132195932L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 182, 26012032527324L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 183, 25912210595421L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 184, 27812230127946L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 185, 29707182119014L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 186, 26712220578842L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 187, 29902021581915L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 188, 26606212365548L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 189, 26201062453818L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 190, 26505122626923L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 191, 26903011925532L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 192, 29104150934231L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 193, 25908202772935L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 194, 29305112434533L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 195, 27809091141226L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 196, 30408110458418L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 197, 26303212559348L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 198, 30406152649934L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 199, 27911070557216L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 200, 29604192279134L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 201, 28310131632728L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 202, 29711141255012L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 203, 27708250891123L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 204, 30512242187043L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 205, 27007171823145L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 206, 26812010695916L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 207, 28606281562033L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 208, 27212100555541L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 209, 27911070557216L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 210, 26102161683017L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 211, 26704012644443L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 212, 28907181573718L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 213, 29906171167018L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 214, 28010051198022L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 215, 25910271883016L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 216, 26903240593732L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 217, 26304081958943L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 218, 30210112797917L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 219, 26710050560525L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 220, 26404161084839L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 221, 30509241483728L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 222, 26004251794235L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 223, 25910191374939L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 224, 29807060933612L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 225, 30311020977349L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 226, 29011272346948L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 227, 27411052118146L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 228, 26209180710143L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 229, 26311211430532L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 230, 29304222143823L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 231, 29602061327126L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 232, 28208070953031L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 233, 29607110985423L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 234, 29604192279134L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 235, 27310072633431L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 236, 28708270328423L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 237, 30211281664546L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 238, 26710060835422L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 239, 27510041789444L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 240, 25606111335012L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 241, 25601190374917L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 242, 25802082334821L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 243, 27408252696237L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 244, 27007121572627L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 245, 27301192714834L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 246, 29211271336524L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 247, 29507171411419L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 248, 29304071192438L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 249, 29309181152935L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 250, 25706241388934L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 251, 29810110723133L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 252, 25910170263539L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 253, 28706272661928L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 254, 30512182354842L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 255, 27505062553044L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 256, 29911162058212L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 257, 27609081887333L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 258, 28404160791449L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 259, 27107201080846L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 260, 26207070450518L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 261, 29805050237031L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 262, 28109140485342L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 263, 26305201632248L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 264, 29509201483533L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 265, 27301211520721L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 266, 27211090914932L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 267, 28907162425713L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 268, 25609150911841L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 269, 27509110737632L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 270, 28303242043947L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 271, 27304051311349L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 272, 25707260961746L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 273, 27906061966143L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 274, 25707260961746L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 275, 26403050919049L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 276, 27511261744633L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 277, 27402270257328L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 278, 28410112142732L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 279, 29511200559448L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 280, 28606280831448L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 281, 28908152583844L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 282, 25606111335012L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 283, 27306201560027L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 284, 26903011925532L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 285, 26401090871233L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 286, 29208111352836L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 287, 27604181195219L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 288, 28406122061644L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 289, 26705181427449L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 290, 25609150911841L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 291, 27807060786621L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 292, 28208070953031L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 293, 29011272346948L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 294, 25911011421642L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 295, 26103191967218L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 296, 26903011925532L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 297, 29906031231545L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 298, 29408171411944L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 299, 29205121611912L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 300, 29705131626346L });

            migrationBuilder.DeleteData(
                table: "Prescription",
                keyColumns: new[] { "Id", "NationalId" },
                keyValues: new object[] { 301, 29207252239815L });
        }
    }
}
